app/Controllers/ClientController.php

    private function debiterSolde(int $idUtilisateur, float $montant): bool
    {
        $solde = $this->utilisateurModel->getSoldeUtilisateur($idUtilisateur);

        if (!$solde) {
            return false;
        }

        return $this->utilisateurModel->update($idUtilisateur, [
            'solde' => (float) $solde - $montant,
        ]);
---
UPDATE `utilisateur` SET `solde` = 399192
WHERE `utilisateur`.`id` IN (7)

    public function depot()
    {
        if ($this->request->getMethod() === 'POST') {
            $montant = (float) $this->request->getPost('montant');

            if ($montant <= 0) {
                return redirect()->back()->with('erreur', 'Montant invalide.');
            }

            $idUtilisateur     = $this->idUtilisateurConnecte();
            $idTypeOperation   = 1;

            $db = \Config\Database::connect();
            $db->transStart();

            $this->utilisateurModel->crediterSolde($idUtilisateur, $montant);
            $this->operationModel->insert([
                'id_type_operation' => $idTypeOperation,
                'envoyeur'          => null,
                'destinataire'      => $idUtilisateur,
                'valeur'            => $montant,
                'frais'             => 0,
                'date_operation'    => date('Y-m-d H:i:s'),
            ]);
---
INSERT INTO `operation` (`id_type_operation`, `envoyeur`, `destinataire`, `valeur`, `frais`, `date_operation`) VALUES (1, NULL, 7, 500000, 0, '2026-07-20 13:26:48')

            $this->debiterSolde($idUtilisateur, $total);
            $this->utilisateurModel->crediterSolde((int) $destinataire['id'], $montant);

            $this->operationModel->insert([
                'id_type_operation' => $idTypeOperation,
                'envoyeur'          => $idUtilisateur,
                'destinataire'      => (int) $destinataire['id'],
                'valeur'            => $montant,
                'frais'             => $frais,
                'date_operation'    => date('Y-m-d H:i:s'),
            ]);
---
INSERT INTO `operation` (`id_type_operation`, `envoyeur`, `destinataire`, `valeur`, `frais`, `date_operation`) VALUES (3, 7, 4, 100000, 808, '2026-07-20 13:27:09')