app/Controllers/Home.php

SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`id` = 7
---
    public function login() {
        $utilisateurModel = new UtilisateurModel();
        $prefixeModel = new PrefixeOperateurModel();

        $numero = $this->request->getPost('numero');

        // if (!$prefixeModel->numeroEstValide($numero)) {
        //     return redirect()->back()->with('erreur', 'Le numéro de téléphone n\'est pas valide.');
        // }

        $utilisateur = $utilisateurModel->findByNumero($numero);

        if (!$utilisateur) {
            $utilisateurId = $utilisateurModel->creerClient($numero);
            $utilisateur = $utilisateurModel->find($utilisateurId);