app/Controllers/TypesOperation.php

    public function index()
    {
        $types = [];
        $error = null;

        try {
            $types = (new TypeOperationModel())->findAll();
---
SELECT *
FROM `type_operation`