app/Models/BaremeModel.php

SELECT *
FROM `bareme`
WHERE `id_type_operation` = 3
AND `borne_inf` <= 100000
AND `borne_sup` >= 100000
 LIMIT 1
---
    public function calculerFrais(int $idTypeOperation, float $montant): float
    {
        $tranche = $this->where('id_type_operation', $idTypeOperation)
            ->where('borne_inf <=', $montant)
            ->where('borne_sup >=', $montant)
            ->first();