app/Models/OperationModel.php

SELECT SUM(`o`.`frais`) AS `total`
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type_operation`
WHERE `t`.`nom` IN ('retrait','transfert')
AND strftime('%Y-%m', o.date_operation) = '2026-07'
SELECT SUM(`o`.`frais`) AS `total`
FROM `operation` `o`
JOIN `type_operation` `t` ON `t`.`id` = `o`.`id_type_operation`
WHERE `t`.`nom` IN ('retrait','transfert')
AND `o`.`date_operation` >= '2026-07-13'
---
    public function totalGains(?string $periode = null): float
    {
        $builder = $this->db->table('operation o')
            ->selectSum('o.frais', 'total')
            ->join('type_operation t', 't.id = o.id_type_operation')
            ->whereIn('t.nom', ['retrait', 'transfert']);

        if ($periode === 'jour') {
            $builder->where('DATE(o.date_operation)', date('Y-m-d'));
        } elseif ($periode === 'semaine') {
            $builder->where('o.date_operation >=', date('Y-m-d', strtotime('-7 days')));
        } elseif ($periode === 'mois') {
            $builder->where("strftime('%Y-%m', o.date_operation) = '" . date('Y-m') . "'", null, false);
        }

        $row = $builder->get()->getRowArray();