app/Models/TypeOperationModel.php

    public function getByNom(string $nom)
    {
        return $this->where('nom', $nom)->first();
---
SELECT *
FROM `type_operation`
WHERE `nom` = 'transfert'
 LIMIT 1