app/Models/UtilisateurModel.php

    public function rechercheParNumero(?string $numero = null): array
    {
        if ($numero === null || trim($numero) === '') {
            return $this->findAll();
---
SELECT *
FROM `utilisateur`

    public function findByNumero(string $numero): ?array
    {
        return $this->where('numero', $numero)->first();
---
SELECT *
FROM `utilisateur`
WHERE `numero` = '0374445566'
 LIMIT 1

    public function getSoldeUtilisateur(int $idUtilisateur): float
    {
        return (float) $this->select('solde')->where('id', $idUtilisateur)->first()['solde'];
---
SELECT `solde`
FROM `utilisateur`
WHERE `id` = 7
 LIMIT 1

    public function creerClient(string $numero): int
    {
        $this->insert([
            'numero' => $numero,
            'est_operateur'    => 0,
            'solde'             => 0
        ]);
---
INSERT INTO `utilisateur` (`numero`, `est_operateur`, `solde`) VALUES ('0337647974', 0, 0)

    public function crediterSolde(int $idUtilisateur, float $montant): bool
    {
        $utilisateur = $this->find($idUtilisateur);
        if (!$utilisateur) {
            return false;
        }

        $nouveauSolde = $utilisateur['solde'] + $montant;
        return $this->update($idUtilisateur, ['solde' => $nouveauSolde]);
---
SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`id` = 4
UPDATE `utilisateur` SET `solde` = 400000
WHERE `utilisateur`.`id` IN (4)